EDA Data Prep
Creation of new basis df using only columns in the POC Model Columns - Confirmed file

In [1]:
import pandas as pd
import numpy as np

In [2]:
new_data = pd.read_csv(r"C:\Users\emanlangit\Documents\2025\00 ACSIN\New Data\SCM_Data_060125_input.csv")
new_data.rename(columns={'LOAN_ACCOUNT_NO': 'loan_account_no'}, inplace=True)

In [ ]:
#skip, for duplicate cleaning only

In [37]:
yo = new_data[['loan_account_no', 'Years at Current City']]
yo[yo.loan_account_no == 'TW01030104000002242640']

               loan_account_no  Years at Current City
127444  TW01030104000002242640                      1
157925  TW01030104000002242640                     18

In [47]:
new_data[new_data.loan_account_no == 'TW01030104000002242640']['Years at Current City']

127444     1
157925    18
Name: Years at Current City, dtype: int64

In [62]:
duplicate_counts = valid_new_data['loan_account_no'].value_counts()
duplicates = duplicate_counts[duplicate_counts > 1]

In [69]:
len(duplicates)

4572

In [78]:
type(duplicates)

pandas.core.series.Series

In [80]:
duplicated_LANs_new_data = list(duplicates.index)

In [82]:
len(duplicated_LANs_new_data)

4572

In [117]:
test_case = duplicated_LANs_new_data[3]

In [118]:
LAN = test_case
temp_df = reduced_valid_new_data[reduced_valid_new_data.loan_account_no == LAN]
row1 = temp_df.iloc[0]
row2 = temp_df.iloc[1]

In [119]:
# Compare rows and find columns with different values
differences = row1 != row2
different_columns = differences[differences].index.tolist()

In [120]:
different_columns

['Years at Current City']

In [121]:
temp_df[different_columns]

       Years at Current City
25188                     22
25189                      0

In [123]:
adjusted_reduced_valid_base_data_old[adjusted_reduced_valid_base_data_old.loan_account_no == LAN][['res_years_at_current_city']]

       res_years_at_current_city
23073                         22

In [142]:
#dealing with duplicated LANs
cleaning_df = new_data.copy()
# Identify duplicated values
duplicates = cleaning_df.duplicated('loan_account_no', keep='first')

# Create a counter to keep track of duplicates
counter = {}

# Loop through the DataFrame and rename duplicates
for idx, value in cleaning_df.loc[duplicates, 'loan_account_no'].items():
    if value not in counter:
        counter[value] = 1
    counter[value] += 1
    cleaning_df.at[idx, 'loan_account_no'] = f"{value}_duplicate{counter[value] - 1}"

In [143]:
cleaning_df

,APPLICATION_NUMBER,CIFNUMBER,CUSTOMER_NUMBER,Application Received Date,Product,Judgement date,DECISION,USER_COMMENT,loan_account_no,LOAN_SANCTIONED_DATE,...,Branch Name,Occupation Type,Industry,Sanctioned ROI,Sanction Tenure,Total Asset Cost,CIBIL score,Unnamed: 29,Unnamed: 30,Unnamed: 31
0,APPL00053183,GLBCUST00000046162,CUST00047706,17-02-22 09:14:55.878000000 PM,2 Wheeler Loan,28-02-22 07:24:02.284000000 PM,Approve,OVERDUE APPROVAL TAKEN FROM ARPITA SAN,TW01030103000002198214,28-02-22,...,East Delhi,Self Employed Non Professional,Apparels,10.80,18,106200,640.0,NaN,NaN,80377.0
1,APPL00045582,GLBCUST00000039525,CUST00040897,10-01-22 12:35:16.738000000 PM,2 Wheeler Loan,11-01-22 03:11:28.143000000 PM,Approve,NO TEST CODE,TW01020102000002194118,11-01-22,...,South Bangalore,Salaried,Others,10.80,30,101000,744.0,NaN,NaN,NaN
2,APPL00045746,GLBCUST00000039670,CUST00041047,11-01-22 11:56:22.212000000 AM,2 Wheeler Loan,11-01-22 12:20:59.868000000 PM,Approve,NO TEST CODE,TW01010101000002194294,11-01-22,...,Eastern Mumbai,Self Employed Non Professional,Apparels,10.80,36,90200,743.0,NaN,NaN,NaN
3,APPL00049588,GLBCUST00000043044,CUST00044507,31-01-22 12:56:42.989000000 PM,2 Wheeler Loan,31-01-22 02:09:58.252000000 PM,Approve,NO TEST CODE,TW01020102000002195778,31-01-22,...,South Bangalore,Salaried,Others,12.60,24,84011,671.0,NaN,NaN,NaN
4,APPL00044448,GLBCUST00000038539,CUST00039882,03-01-22 01:47:17.077000000 PM,2 Wheeler Loan,03-01-22 02:32:45.828000000 PM,Approve,NO TEST CODE,TW01030102000002193651,03-01-22,...,South Delhi,Salaried,Others,11.88,18,61900,-1.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
241884,APPL00109409,GLBCUST00000095605,CUST00098378,08-10-22 01:05:40.334000000 PM,2 Wheeler Loan,08-10-22 01:54:19.731000000 PM,Reject,DUAL PAN CARD,nan_duplicate80372,NaN,...,Thane,Self Employed Non Professional,Others,10.99,36,99100,758.0,NaN,NaN,NaN
241885,APPL00235755,GLBCUST00000204351,CUST00210880,24-10-23 05:24:09.630000000 PM,2 Wheeler Loan,24-10-23 06:34:10.649000000 PM,Reject,Negative Cibil,nan_duplicate80373,NaN,...,Virar,Salaried,Others,11.75,36,126000,687.0,NaN,NaN,NaN
241886,APPL00130109,GLBCUST00000113822,CUST00117024,07-12-22 03:05:58.124000000 PM,2 Wheeler Loan,07-12-22 05:24:20.350000000 PM,Approve,no test code,nan_duplicate80374,NaN,...,Eastern Mumbai,Self Employed Non Professional,Others,11.29,24,92419,738.0,NaN,NaN,NaN
241887,APPL00199935,GLBCUST00000174126,CUST00179430,02-08-23 02:07:45.392000000 PM,2 Wheeler Loan,03-08-23 07:52:59.236000000 PM,Reject,EARLIER REJECTED,nan_duplicate80375,NaN,...,N Western Mumbai,Salaried,Others,11.75,24,141199,-1.0,NaN,NaN,NaN
241888,APPL00187534,GLBCUST00000163389,CUST00168314,22-06-23 01:50:34.369000000 PM,2 Wheeler Loan,22-06-23 02:48:48.757000000 PM,Reject,CIBIL Negative,nan_duplicate80376,NaN,...,South Bangalore,Self Employed Non Professional,Others,11.50,30,98000,565.0,NaN,NaN,NaN

In [140]:
reduced_valid_new_data.shape

(56752, 22)

In [141]:
adjusted_reduced_valid_base_data_old.shape

(52179, 34)

In [65]:
new_data[new_data.loan_account_no == 'TW01010107000002236997']['Years at Current City']

125674     1
156182     0
216663    10
Name: Years at Current City, dtype: int64

In [74]:
new_data[new_data.loan_account_no == 'TW01010107000002236997']

,APPLICATION_NUMBER,CIFNUMBER,CUSTOMER_NUMBER,Application Received Date,Product,Judgement date,DECISION,USER_COMMENT,loan_account_no,LOAN_SANCTIONED_DATE,...,Branch Name,Occupation Type,Industry,Sanctioned ROI,Sanction Tenure,Total Asset Cost,CIBIL score,Unnamed: 29,Unnamed: 30,Unnamed: 31
125674,APPL00150292,GLBCUST00000131198,CUST00135017,18-02-23 01:14:27.892000000 PM,2 Wheeler Loan,22-02-23 05:16:59.082000000 PM,Approve,No test code change in model and loan amount,TW01010107000002236997,22-02-23,...,Western Mumbai,Self Employed Non Professional,Apparels,11.29,24,102100,147.0,NaN,NaN,NaN
156182,APPL00150292,GLBCUST00000131198,CUST00135017,18-02-23 01:14:27.892000000 PM,2 Wheeler Loan,22-02-23 05:16:59.082000000 PM,Approve,No test code change in model and loan amount,TW01010107000002236997,22-02-23,...,Western Mumbai,Self Employed Non Professional,Apparels,11.29,24,102100,147.0,NaN,NaN,NaN
216663,APPL00150292,GLBCUST00000131198,CUST00135017,18-02-23 01:14:27.892000000 PM,2 Wheeler Loan,22-02-23 05:16:59.082000000 PM,Approve,No test code change in model and loan amount,TW01010107000002236997,22-02-23,...,Western Mumbai,Self Employed Non Professional,Apparels,11.29,24,102100,147.0,NaN,NaN,NaN

In [68]:
base_data_old[base_data_old.loan_account_no == 'TW01010107000002236997']['res_years_at_current_city']

36558    1
Name: res_years_at_current_city, dtype: int64

In [5]:
valid_LAN_buckets = pd.read_csv(r"C:\Users\emanlangit\Documents\2025\00 ACSIN\New Data\Data_Req_2023_2024_input.csv")
valid_LAN_buckets.loan_account_no.nunique()

C:\Users\emanlangit.AEONCREDIT\AppData\Local\Temp\ipykernel_22228\1583221271.py:1: DtypeWarning: Columns (14,15,16,17,22,23) have mixed types. Specify dtype option on import or set low_memory=False.
  valid_LAN_buckets = pd.read_csv(r"C:\Users\emanlangit\Documents\2025\00 ACSIN\New Data\Data_Req_2023_2024_input.csv")

52197

In [6]:
scm_LAN = set(new_data.loan_account_no.unique().tolist())
valid_LAN = set(valid_LAN_buckets.loan_account_no.unique().tolist())

diff = valid_LAN - scm_LAN
print(diff)

{'TW01010106000002278653', 'TW01030105000002271188', 'TW01030107000002284132', 'TW01010102000002270418', 'TW01010106000002268398', 'TW01030102000002281156', 'TW01030103000002278039', 'TW01020101000002279416', 'TW01030105000002283039', 'TW01020102000002279302', 'TW01020102000002279638', 'TW01030102000002271349', 'TW01030105000002287535', 'TW01010106000002278144', 'TW01020102000002289161', 'TW01010103000002258833', 'TW01030107000002270125', 'UT01020103000002274943'}

In [74]:
len(diff)

18

In [7]:
missing_LANs = list(diff)

In [61]:
missing_LANs

['TW01010106000002278653',
 'TW01030105000002271188',
 'TW01030107000002284132',
 'TW01010102000002270418',
 'TW01010106000002268398',
 'TW01030102000002281156',
 'TW01030103000002278039',
 'TW01020101000002279416',
 'TW01030105000002283039',
 'TW01020102000002279302',
 'TW01020102000002279638',
 'TW01030102000002271349',
 'TW01030105000002287535',
 'TW01010106000002278144',
 'TW01020102000002289161',
 'TW01010103000002258833',
 'TW01030107000002270125',
 'UT01020103000002274943']

In [8]:
52197 - 18 #there were 18 LANs not in the SCM data but were in the valid data

52179

In [60]:
base_data_old[base_data_old.loan_account_no == 'TW01010101000002305325']

Empty DataFrame
Columns: [loan_account_no, Mar'24, Apr'24, May'24, Jun'24, Jul'24, Aug'24, portfolio_report_date, product_category_id, product_type_id, product_type, product_code, productid, product_description, hps_flag, mult_asset, asset_category, manufacturer, asset_model, dealer, branch_id, branch_name, channel, alternate_channel_mode, schemeid, scheme_description, loan_boarding_date, interest_start_date, loan_sanctioned_date, disbursal_date, last_disbursal_date, repayment_start_date, maturitydate, original_tenure, number_of_installments, loan_asset_cost, down_payment_amount, final_sanctioned_amount, disbursal_amount, adjusted_amount_at_disbursal, original_emi_amount, installment_amount, interest_type, effective_interest_rate, interest_rate, customer_interest_rate, last_mis_snapshot_date, effective_roi, disbursal_flag, grace_days, finance_mode, ltv, application_number, application_type, loan_application_date, approval_date, tat, requested_loan_amount, loan_purpose, bureau_score, mult_cibil, Age_Mini, MaxAge01, MaxAge02, LTVDPD01, LTVDPD2, LTVDPD3, LTVDPD4, CustDoc1, CIBIL_OD, negtArea, deviation_cnt, verification_waived, PerVeri_FieldVer, PerVeri_TelVer, ResiVeri_FieldVer, ResiVeri_TelVer, other_verification, identification_verification, address_verification, central_bank_check_verfication, other_checks, customer_risk_category, mult_kyc, ref_colleague, ref_parents_relatives, ref_friend, ref_trade_reference, ref_neighbor, ref_business_associate, total_reference, customer_no, res_city, res_state, res_years_at_current_address, res_years_at_current_city, res_resident_status, res_resident_type, res_primary_address, perm_city, ...]
Index: []

[0 rows x 174 columns]

In [9]:
base_data_old = pd.read_csv(r"C:\Users\emanlangit\Documents\ACSIN\01 ACSIN EDA\Data\BASE DATA FOR EDA_1.csv")

C:\Users\emanlangit.AEONCREDIT\AppData\Local\Temp\ipykernel_22228\2271076420.py:1: DtypeWarning: Columns (1,2,3,4,5,6,166,170) have mixed types. Specify dtype option on import or set low_memory=False.
  base_data_old = pd.read_csv(r"C:\Users\emanlangit\Documents\ACSIN\01 ACSIN EDA\Data\BASE DATA FOR EDA_1.csv")

In [10]:
#merge valid LANs and new data
valid_new_data = valid_LAN_buckets.merge(new_data,how='inner',on=['loan_account_no'])
#drop duplicated loan_account_no
#valid_new_data = valid_new_data.drop_duplicates(subset='loan_account_no')
# Drop extra columns from merged DataFrame
#valid_new_data = valid_new_data.drop(columns=['Unnamed: 29','Unnamed: 30','Unnamed: 31'])

In [11]:
valid_new_data.loan_account_no.nunique()

52179

In [12]:
#valid_new_data.columns
necessary_cols = ['loan_account_no','APPLICATION_NUMBER', 'CUSTOMER_NUMBER',
                 'Product','LOAN_AMOUNT','ORIGINAL_EMI_AMOUNT','Years at Current City',
                 'Resident Status', 'City', 'State', 'AGE', 'DATE_OF_BIRTH', 'Manufacturer',
                  'Down Payment Amount', 'Total Income', 'Branch Name', 'Occupation Type',
                  'Industry','Sanctioned ROI', 'Sanction Tenure', 'Total Asset Cost',
                  'CIBIL score']
reduced_valid_new_data = valid_new_data[necessary_cols]

In [13]:
#base_data_old.columns.tolist()

In [14]:
requested_cols = ['application_number', 'customer_no', 'product_description',
                 'loan_account_no', 'requested_loan_amount', 'original_emi_amount',
                 'res_years_at_current_city', 'res_resident_status','res_city',
                 'res_state', 'age', 'date_of_birth', 'manufacturer', 'down_payment_amount',
                 'total_income', 'branch_name', 'occupation_type', 'industry', 'interest_rate',
                 'number_of_installments', 'loan_asset_cost', 'bureau_score', 'asset_category',
                 'asset_model', 'dealer', 'branch_id', 'channel', 'final_sanctioned_amount',
                 'disbursal_amount', 'res_years_at_current_address', 'gender', 'marital_status',
                 'nature_of_business', 'years_in_occupation']
#merge valid LANs and new data
valid_base_data_old = valid_LAN_buckets.merge(base_data_old,how='inner',on=['loan_account_no'])
#drop duplicated loan_account_no
valid_base_data_old = valid_base_data_old.drop_duplicates(subset='loan_account_no')
reduced_valid_base_data_old = valid_base_data_old[requested_cols]

In [15]:
adjusted_reduced_valid_base_data_old = reduced_valid_base_data_old[~reduced_valid_base_data_old['loan_account_no'].isin(missing_LANs)]

In [16]:
adjusted_reduced_valid_base_data_old.loan_account_no.nunique()

52179

In [26]:
# new_var = APPLICATION_NUMBER
# old_var = application_number

# new_var_set = set(reduced_valid_new_data[new_var].tolist())
# base_var_set = set(reduced_base_data_old[old_var].tolist())

In [27]:
# instersection = new_var_set.intersection(base_var_set)
# len(instersection)
#should be 52179

In [20]:
new_var = 'Years at Current City'
old_var = 'res_years_at_current_city'

compare1 = ['loan_account_no', new_var]
compare2 = ['loan_account_no', old_var]
c1 = reduced_valid_new_data[compare1]
#c1.rename(columns={'APPLICATION_NUMBER': 'application_number'}, inplace=True)
c2 = adjusted_reduced_valid_base_data_old[compare2]
#optional
#replace_dict = {'2 Wheeler Loan': 'Two-Wheeler', 'Used Two Wheeler Loan': 'Used Two-Wheeler'}
#c1[new_var] = c1[new_var].replace(replace_dict)

set1 = set(zip(c1['loan_account_no'], c1[new_var]))
set2 = set(zip(c2['loan_account_no'], c2[old_var]))
are_equal = set1 == set2
print(are_equal)

False

In [18]:
# c1[new_var].unique()
# c2[old_var].unique()

In [21]:
len(set1 - set2) #1847

3631

In [23]:
len(set1 - set2)

3631

In [27]:
do = adjusted_reduced_valid_base_data_old[['loan_account_no', 'res_years_at_current_city']]

In [28]:
re = reduced_valid_new_data[['loan_account_no', 'Years at Current City']]

In [29]:
merged_do_re= do.merge(re,how='inner',on=['loan_account_no'])

In [32]:
merged_do_re[merged_do_re['Years at Current City'] != merged_do_re['res_years_at_current_city']]

,loan_account_no,res_years_at_current_city,Years at Current City
17,TW01010101000002245739,23,0
25,TW01030104000002242640,1,18
28,TW01010101000002242133,22,0
53,TW01010101000002233078,23,0
56,TW01020103000002230973,8,26
...,...,...,...
56685,TW01020102000002276238,5,21
56700,TW01020102000002276605,5,0
56702,TW01010101000002276225,22,0
56709,TW01010101000002276804,23,0
56720,TW01020102000002277204,4,0

In [35]:
adjusted_reduced_valid_base_data_old[['loan_account_no', 'res_years_at_current_city']]

              loan_account_no  res_years_at_current_city
0      TW01010102000002232820                         50
1      TW01010105000002234218                          0
2      TW01010103000002238104                         23
3      TW01010101000002233090                         10
4      UT01030105000002236675                         20
...                       ...                        ...
52192  TW01020102000002280426                         10
52193  TW01020103000002281621                         10
52194  TW01010107000002248785                          0
52195  TW01010105000002284748                          0
52196  UT01010105000002286094                          0

[52179 rows x 2 columns]